
		<!DOCTYPE html>
		<html>
			<head>
<meta charset="utf-8">
<title> Еко-кошик </title>
<link rel='stylesheet' type='text/css' href='style.css'>
<link rel="stylesheet" type="text/css" href="js/jquery-ui.css">
<script type="text/javascript" src="js/jquery.js"></script>
<script type="text/javascript" src="js/jquery-ui.min.js"></script>
			</head>
			<body background='Img/wall.jpg'>
<script>
/* 
ЗАГАЛЬНИЙ ПЛАН КРОКУ № 3

	І. Змінюємо функцію read_id(), перевіряємо її роботоздатність.
*/
var $idtov='';
var $oktov=0;

$(function(){
	click_menu()
	click_tovar()
	read_id() 
});

/* 4. Функція, яка читає з кукіса номери вибраних користувачем товарів
    	З допомогою методу $.ajax({...}) запускається на виконання файл  read_id.php
    		$x=explode(";",$_COOKIE["idtov"]);
    		echo json_encode($x);
    	змінна $_COOKIE["idtov"] читається з кукіса автоматично і містить рядок 
    	з номерами товарів, наприклад "2;4;5;" (читається інформація у тому випадку,
    	коли попередньо була запущена процедура save_id()).

    	Функція explode ($x=explode(";",$_COOKIE["idtov"]);) формує
    	масив $x з значеннями номерів, записаних у кукіс, товарів. Тобто 
    	$x[0]=2, $x[1]=4, $x[2]=5, $x[3]='', (";" - є роздільником функції explode, 
		все що між роздільником записується у окрему комірку масиву, остання ";" формує 
		пусту комірку, у нашому прикладі це комірка $x[3])

    	Команда echo json_encode($x); повертає масив $x назад у javascript у 
    	функцію read_id(). Тобто метод $.ajax({...}) викликає на виконання php-файл і після
    	його виконання все, що було виведене на екран з допомогою команди echo повертається 
    	у змінну data параметра success метода ajax ( success: function(data){...}). 

    	Функція php - json_encode($x) потрібна для переведення назад у javascript
    	саме json-масиву, а не html-коду (json-масив у нашому прикладі аналогічний 
    	звичайному одновимірному масиву). Масив $x php-файлу стає масивом data у
		javascript-файлі. Тому після успішного (success:) виконання php-файлу у 
		javascript з'явиться json-масив data з відповідними комірками data[0]=2,
		data[1]=4, data[2]=5, data[3]='' (аналогічний масиву $x php-файлу). 

		У розділі "success:" методу $.ajax({...}) функції read_id() створюємо змінну 
    	$oktov яка міститиме кількість вибраних користувачем товарів за попередній 
    	період роботи сторінки інтернет-магазину, тобто після перезавантаження браузера.
    	($oktov=data.length-1;). 

    	Далі записуємо к-сть вибраних користувачом товарів у 
    	поле сайту з id='ok' (команда $('#ok').text($oktov);)

    	Наступним кроком запускається цикл (for($i=0;$i<$oktov;$i++){...}) який шукає
    	всі div (квадратики) у яких id є таким же як і номер вибраного користувачем 
    	товару $(".kosik div[id="+data[$i]+"]"). До кожного із знайдених квадратиків
    	приміняємо методи: 
    					removeClass("kosik1") - видалити клас kosik1
    					addClass("kosik2")    - додати клас   kosik2
    					attr("title","ok")	  - змінити значення атрибуту "title" на "ok"
    	Цикл у ф-ції read_id(){...} запускається тоді, коли значення $oktov є > 0, тобто
    	тоді, коли у попередній сеанс роботи браузера користувачем було вибрано хоча б 
    	один товар. У іншому випадку процедура буде запущенна, але цикл не працюватиме. 
 
    	Для перевірки нам потрібно запустити сайт, потім вибрати товари, потім перевантажити
    	сторінку, тобто повторно запустити сайт. При перевантажені сторінки товари, 
    	які були вибрані користувачем у попередній сеанс роботи мають бути відмічені
		галочкою.
*/	
	function read_id(){ 
		$.ajax({
			type:"POST",
			url: "read_id.php",
			dataType: "json",
			success: function(data){
					$oktov=data.length-1
					$('#ok').text($oktov)
					for($i=0;$i<$oktov;$i++){
						$(".kosik div[id="+data[$i]+"]").removeClass("kosik1").addClass("kosik2").attr("title","ok")
					}

			}
		});
	}
	
// end 4.

// 3.	Функція save_id() складається з трьох частин:

//		Частина 1 - підрахунок кількості вибраного товару і формування 
//		рядка id вибраних товарів.
	
//		У звязку з тим, що наш магазин розрахований на невелику кількість
//		товару, то при кожноу кліку по квадратику перевіряється у циклі
//		$('.kosik2').each(function(){...}) весь список вибраних товарів.
//		У циклі формуються дві змінні: 
//			$oktov 	- 	відповідає за кількість вибраних товарів
//			$idtov 	- 	рядкова змінна у якій є номера товарів  
//						розділених символом ";", наприклад	
//						"2;4;5;" - кристувачем вибрані товари з 
//						id = 2,4,5
//		Частина 2 - запис кількості вибраних товарів у верхню частину 
//		інтернент агазину $('#ok').text($oktov)
//		
//		Частина 3 - запис рядка з номерами вибраних товарів у кукіс (пам'ять 
//		кокретного браузера, тобто браузера користувача, на комп'ютері користувача)
//		Для запису використовується метод $.ajax({}) який з функції javascript викликає
//		php файл, конкретно save_id.php. При виклику цього файлу у нього передається
//		методом POST змінна idtov яка матиме значення $idtov (наприклад "2;4;5;")
//		У файлі є тільки 2 рядки:
//				$idtov=$_POST['idtov'];
//				setcookie('idtov',$idtov,time()+3600,'/');
//			1 рядок - прийом значення переданого у файл методом POST,
//			тобто php-змінна $idtov отримає значення, наприклад  "2;4;5;"
//			2 рядок - формує у головному каталозі кукіса ('/') змінну idtov 
//			з значенням $idtov (наприклад "2;4;5;"), змінна "житиме" 3600 секунд

	function save_id(){
			$idtov='';
			$oktov=0;
			$('.kosik2').each(function(){
				$idtov+=$(this).attr('id')+';'
				$oktov++
			});
			
			$('#ok').text($oktov)
			
			$.ajax({
				type:"POST",
				url:"save_id.php",
				data:({idtov:$idtov})
			});
		}
// end 3.

// 2. 	Функція click_tovar() слідкує за тим, чи був здійснений клік мишки 
//		по "квадратику" (контейнер div у класі .kosik зліва від товару). 
//		Якщо такий клік відбувся, тоді клас стилю 'kosik1' видаляється, 
//		а клас стилю 'kosik2' додається до контейнера div ("квадратик").
//		Таким чином зображення квадратика стає з "галочкою", тобто товар 
//		стає візуально вибраний. Для програмного вибору товару змінюємо
//		значення атрибута 'title'. По замовчуванню, тобто коли товар не 
//		вибраний значення атрибута 'title' = пустоті. При виборі товару
//		значення атрибута стає рівне 'ok'. Так програмно визначається 
//		вибраний користувачем товар - той товар у якого атрибут 'title' = 'ok'

//		Функція спочатку перевіряє чи відбувся клік по квадратику, якщо клік
//		відбувся, тоді перевіряється чи це був клік по товару, який ще не вибраний.
//		Якщо товар ще не вибраний, тоді міняється клас стилю на 'kosik2' і у 
//		атрибут 'title' записується 'ok'. Якщо клік відбувся по товару який уже 
//		вибраний, тоді клас стилю 'kosik2' змінюється на 'kosik1' і у атрибут
//		'title' записується пустота, тобто товар з вибраного стає невибраний.

//		В кінці функції, тобто при кожному кліку по квадратику відбувається
//		запуск функції save_id(), яка записує вибрані товари у кукіс.

	function click_tovar()
	{
		$('.kosik div').click(function(){
			if($(this).attr('title')==""){
				$(this).removeClass('kosik1').addClass('kosik2').attr('title','ok');
			}else{
				$(this).removeClass('kosik2').addClass('kosik1').attr('title','');
			}
			save_id();
		});
	}
	
// end 2.

// 1.

	function click_menu(){
		$('#k1').click(function(){		
			$("#AboutShop").dialog({"width":800});
		});
		$('#k2').click(function(){		
			$("#Regulations").dialog({"width":800});
		});
		$('#k3').click(function(){		
			$("#Kontakts").dialog({"width":800});
		});
	}
	
// end 1.



</script>
<div id='main'> <!-- контейнен магазину -->
	<div id='top'> <!-- контейнен верхньої частини магазину -->
		<div id='k1' title='Про магазин "Еко Кошик"'></div>
		<div id='k2' title='Правила магазину'></div>
		<div id='k3' title='Контакти(Адреса)'></div>
		<div id='ks'></div>
		<div id='vt'>
			<span id='SelectTovar'>Вибрано товарів:</span><span id='ok'>0</span>
		</div>
	</div>
	<div id='fon_tovar'> <!-- контейнен товарів -->
		<table border='0' width='100%' cellspacing='20' id='tab_tovar'>
			<?	include "tovar.php"; ?>
		</table >
	</div>
</div>

<!-- 
id='AboutShop' - контейнер з інформацією про магазин. На початку завантаження сторінки контейнер є невидимий (дивись клас h_w). Вікно стає видимим з допомогою функції  click_menu() (її першої частини) при кліку мишки по кнопці 'Про магазин "Еко Кошик"'
	$('#k1').click(function(){		
		$("#AboutShop").dialog({"width":800});
	}); 
Аналогічні вікна: Regulations, Kontakts 
-->

<div class='h_w' id='AboutShop' title='ІНФОРМАЦІЯ ПРО НАШ МАГАЗИН'>
	<center><img src='Img/eko.jpg'></center>
	<p class='P_AboutShop'>
		Органічні продукти харчування - це сертифіковані, органічні, натуральні, екологічно-чисті, безпечні продукти харчування з природнім терміном зберігання. Органічні продукти виключають можливість використання генномодифікованих компонентів, пестицидів, мінеральних добрив, антиоксидантів, ароматизаторів, стабілізаторів, барвників, покращувачів смаку та інших добавок штучного походження.
	</p>
	<p class='P_AboutShop'>
		Продаж органічних продуктів харчування передбачає поставку продукції лише від виробників, діяльність яких відповідає сертифікації та стандартам Міжнародної федерації руху за органічне сільське господарство IBS-IFOAM Basic Standart`s. Кожен органічний продукт має спеціальне маркування та відповідний сертифікат, які підтверджують його якість.
	</p>
	<p class='P_AboutShop'>
		Органічний магазин "Еко-кошик" пропонує Вам придбати натуральні органічні продукти харчування з можливістю доставки вибраних товарів додому.
	</p>
</div>

<div class='h_w' id='Regulations' title='ПРАВИЛА ПОКУПОК У НАШОМУ МАГАЗИНІ'>
	<center><img src='Img/eko.jpg'></center>
	<p class='P_Regulations'>
		Купувати товари під фейковою адресою, номером телефона, іменем, прізвищем - ЗАБОРОНЕНО!
	</p>
	<h2 class='Aktsia'>Акція:</h2>
	<p class='P_Regulations'>	
		При покупці товару більше ніж на 250грн. ви отримуєте сертифікат-знижку 30% на придбання м'ясних виробів.
	</p>
</div>

<div class='h_w' id='Kontakts' title='НАШІ КООРДИНАТИ'>
	<p>Контактний телефон: 067 208 59 27, e-mail: torgeirchannel@gmail.com </p>
	<center>	
		<iframe src="https://www.google.com/maps/embed?pb=!1m18!1m12!1m3!1d2588.2159713781916!2d25.6483475!3d49.55594800000003!2m3!1f0!2f0!3f0!3m2!1i1024!2i768!4f13.1!3m3!1m2!1s0x473033eeea919ffd%3A0xfea81f1749956c80!2z0LLRg9C7LiDQmtC-0YDQvtC70YzQvtCy0LAsIDQsINCi0LXRgNC90L7Qv9GW0LvRjCwg0KLQtdGA0L3QvtC_0ZbQu9GM0YHRjNC60LAg0L7QsdC70LDRgdGC0Yw!5e0!3m2!1suk!2sua!4v1431278901225" width="600" height="450" frameborder="2" style="border:0"></iframe>
	</center>
	<br>
</div>


			
			</body>
	</html>