-- phpMyAdmin SQL Dump
-- version 4.6.6
-- https://www.phpmyadmin.net/
--
-- Хост: localhost
-- Время создания: Мар 26 2017 г., 22:37
-- Версия сервера: 5.7.17-11-beget-log
-- Версия PHP: 5.6.30

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- База данных: `s662720h_uuuuu`
--

-- --------------------------------------------------------

--
-- Структура таблицы `FIGHT`
--
-- Создание: Мар 01 2017 г., 02:05
--

DROP TABLE IF EXISTS `FIGHT`;
CREATE TABLE `FIGHT` (
  `id` int(30) NOT NULL,
  `name` varchar(255) NOT NULL,
  `mini` text NOT NULL,
  `text` text NOT NULL,
  `foto` varchar(255) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Дамп данных таблицы `FIGHT`
--

INSERT INTO `FIGHT` (`id`, `name`, `mini`, `text`, `foto`) VALUES
(1, 'Бокс', '<h1>Бокс</h1>', '<h1>Бокс</h1>\r\n<p id=\"negrich\">\r\n	Бо́кс — (англ. boxing) різновид спорту, кулачний бій у рукавичках між двома спортсменами, у якому удари завдаються лише у верхню половину тіла спереду та збоку. До програми сучасних Олімпійських ігор бокс був включений 1904 року.\r\n\r\nБій відбувається на спеціально обладнаному місці — рингу (від 5 лі X 5 м до 7 лі X 7 лі), обнесеному канатами. Поєдинок триває, зазвичай, три раунди по 3 хвилини з перервами на 1 хвилину в «любительському» спорті і до 12 раундів у професійному. Бій ведеться в набитих волосом шкіряних рукавицях. Забороняється завдавати ударів нижче пояса, в спину, головою і нападати на противника у нокдауні (збитого на землю). Перемога присуджується за очками (кількість завданих ударів), при проведенні нокаута — удару, що виводить противника з ладу більш як на 10 сек., або за іншими показниками. Боксерів поділяють на 10 вагових категорій.\r\n</p>', 'http://martialart.it-elit.in.ua/img/a3.jpg'),
(2, 'Кунг-фу', '<h1>Кунг-фу</h1>', '<h1>Кунг-фу</h1>\r\n<p id=\"negr\">\r\n		Згідно з легендою ченця-дзен-буддиста на ім\'я Бодхідхарма Сарділі, гунфу, можливо, має свої корені в Індії. Цей чернець (китайською відомий як Да Мо) подорожував з Індії до Китаю близько 500-го року н.е. Вважається, що він відвідав шаолінських ченців у провінції Хенань та вразив їх своєю майстерністю у медитації. Таємниця полягала у фізичній дисципліні, якої, як бачив Бодхідхарма, не вистачало ченцям. Він почав навчати їх вправам, створеним для зміцнення тіла та витривалості. Згідно з легендою, Бодхідхарма досягнув такого рівня контролю над своїми силами, що самим поглядом міг зробити отвір у стіні протягом декількох років медитації. Ченці використали вивчені вправи і почали вчитися у багатьох мандрівників, що тимчасово зупинялися у манастирі, та у генералів, які залишали службу і ставали ченцями. Протягом століть гунфу ченців ставало швидшим, сильнішим та витонченішим, ніж будь-що, досягнуте поза межами Шаолінського манастиря. Поступово їх мистецтво викликало захоплення у всьому Китаї. Тому і вважається, що саме Бодхідхарма розповсюдив Чань (Дзен) буддизм у Китаї та надихнув шаолінські методи гунфу.\r\n\r\nТермін гунфу не був популярним до 20-го століття. У зв\'язку з цим, він лише зрідка зустрічається у стародавніх текстах. Вперше термін згадується у західному світі французьким єзуїтом-місіонером на ім\'я Жан Жозеф Марі Аміо у звіті, який був мало відомий іншими мовами до пізніх 1960-х років, коли він став популярним завдяки фільмам з бойовими мистецтвами, особливо фільмам з Брюсом Лі та пізніше, телевізійному серіалу Гунфу.</p>\r\n', 'http://martialart.it-elit.in.ua/img/a2.jpg'),
(3, 'Реслінг ', '<h1>Реслінг</h1>', '<h1>Реслінг </h1>\r\n<p id=\"nigrich\">\r\nРеслінг (також рестлінг, англ. Professional wrestling) — вид постановочного дії, що поєднує атлетичні навички, бойові мистецтва і театральну майстерність. Сценарії у рестлінгу розвиваються в ході шоу, організованих різними компаніями — промоушенами (як правило, кожна компанія має своє власне шоу і свої власні сценарії). В ході постановочних боїв визначаються чемпіони, претенденти, вирішуються питання закулісся. Базується рестлінг на поєднанні класичної греко-римської боротьби і так званого «захватного» (англ. catch) рестлінга (звідки інша назва реслінгу — кетч). В ході еволюції даного виду боїв до рестлінгу додавалися атакуючі і силові прийоми, кидки і нові захвати, а також різноманітні акробатичні маневри. Багато в рестлінг прийшло з різних бойових мистецтв. У сучасному рестлінгу все частіше вдаються до використання допоміжних предметів», які допомагають здолати супротивника. Таким предметом може стати все, що рестлер може використовувати в свою користь — стільці, столи, сходи, навіть чемпіонські пояси. У кожному промоушені по-різному ставляться до використання такого роду «знаряддя» — десь їх використання суворо наказано сюжетом, а де-то підручні предмети часто йдуть в хід, як незамінна частина сюжету.\r\n</p>', 'https://upload.wikimedia.org/wikipedia/commons/thumb/b/b5/Wrestling_-_Sikeston%2C_MO_1938_-_1.jpg/350px-Wrestling_-_Sikeston%2C_MO_1938_-_1.jpg');

--
-- Индексы сохранённых таблиц
--

--
-- Индексы таблицы `FIGHT`
--
ALTER TABLE `FIGHT`
  ADD PRIMARY KEY (`id`);

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
